Revit 2015 API
View.ShowEdges Property
 Indicates whether the edges are visible or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2015, use GetViewDisplayModel and SetViewDisplayModel instead.")]
public bool ShowEdges { get; set; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2015, use GetViewDisplayModel and SetViewDisplayModel instead.")> _
Public Property ShowEdges As Boolean
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2015, use GetViewDisplayModel and SetViewDisplayModel instead.")]
public:
property bool ShowEdges {
	bool get ();
	void set (bool value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: This view does not contain display-related properties.
See Also
View Class
Autodesk.Revit.DB Namespace